In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)  # 2 boyutlu

In [3]:
data

array([[ 0.67867272,  0.02905788,  0.17466506],
       [ 0.23044259, -0.78447208,  0.0840872 ],
       [ 0.9107619 , -0.29412849, -0.1946185 ],
       [-0.10464207,  0.08533202, -1.1624697 ]])

In [4]:
df = pd.DataFrame(data)

In [5]:
df

          0         1         2
0  0.678673  0.029058  0.174665
1  0.230443 -0.784472  0.084087
2  0.910762 -0.294128 -0.194618
3 -0.104642  0.085332 -1.162470

In [6]:
df[0]  # kolon olarak gelir

0    0.678673
1    0.230443
2    0.910762
3   -0.104642
Name: 0, dtype: float64

In [7]:
type(df[0])

pandas.core.series.Series

In [10]:
df1 = pd.DataFrame( data , index = ["Ayse","Osman","Arzu","Omer"], columns = ["Maas","Yas","Calisma Saati"])

#

In [11]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [12]:
df1["Yas"]

Ayse     0.029058
Osman   -0.784472
Arzu    -0.294128
Omer     0.085332
Name: Yas, dtype: float64

In [13]:
df1["Calisma Saati"]

Ayse     0.174665
Osman    0.084087
Arzu    -0.194618
Omer    -1.162470
Name: Calisma Saati, dtype: float64

In [14]:
df1[["Maas","Yas"]]

           Maas       Yas
Ayse   0.678673  0.029058
Osman  0.230443 -0.784472
Arzu   0.910762 -0.294128
Omer  -0.104642  0.085332

In [15]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [ ]:
df1["Ayse"]

In [17]:
df1.loc["Ayse"]   # satır ismiyle

Maas             0.678673
Yas              0.029058
Calisma Saati    0.174665
Name: Ayse, dtype: float64

In [18]:
df1.loc["Osman"]

Maas             0.230443
Yas             -0.784472
Calisma Saati    0.084087
Name: Osman, dtype: float64

In [19]:
df1.iloc[1]  # satır indeksi ile

Maas             0.230443
Yas             -0.784472
Calisma Saati    0.084087
Name: Osman, dtype: float64

In [20]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [21]:
df1["Emeklilik Yasi"] = df1["Yas"] + 60

In [22]:
df1

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Ayse   0.678673  0.029058       0.174665       60.029058
Osman  0.230443 -0.784472       0.084087       59.215528
Arzu   0.910762 -0.294128      -0.194618       59.705872
Omer  -0.104642  0.085332      -1.162470       60.085332

In [23]:
df1.drop("Emeklilik Yasi")  # axis = 0 default hata verir, satırlarda yok çünkü

KeyError: "['Emeklilik Yasi'] not found in axis"

In [24]:
df1.drop("Emeklilik Yasi", axis = 1)  # axis = 1 yazmalıyız, çünkü sütun

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [25]:
df1

           Maas       Yas  Calisma Saati  Emeklilik Yasi
Ayse   0.678673  0.029058       0.174665       60.029058
Osman  0.230443 -0.784472       0.084087       59.215528
Arzu   0.910762 -0.294128      -0.194618       59.705872
Omer  -0.104642  0.085332      -1.162470       60.085332

In [ ]:
df1.drop("Emeklilik Yasi" , axis = 1 , inplace = True)

In [28]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [29]:
df1.loc["Ayse"]["Calisma Saati"]

0.1746650632502418

In [30]:
df1.loc["Ayse","Calisma Saati"]

0.1746650632502418

In [32]:
df1.loc["Osman"]["Yas"]

-0.7844720796659083

In [33]:
df1.loc["Osman" , "Yas"]

-0.7844720796659083

In [34]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [35]:
df1 < 0

        Maas    Yas  Calisma Saati
Ayse   False  False          False
Osman  False   True          False
Arzu   False   True           True
Omer    True  False           True

In [36]:
df1Bool = df1 < 0

In [37]:
df1Bool

        Maas    Yas  Calisma Saati
Ayse   False  False          False
Osman  False   True          False
Arzu   False   True           True
Omer    True  False           True

In [38]:
df1[df1Bool]

           Maas       Yas  Calisma Saati
Ayse        NaN       NaN            NaN
Osman       NaN -0.784472            NaN
Arzu        NaN -0.294128      -0.194618
Omer  -0.104642       NaN      -1.162470

In [39]:
df1[df1 < 0]

           Maas       Yas  Calisma Saati
Ayse        NaN       NaN            NaN
Osman       NaN -0.784472            NaN
Arzu        NaN -0.294128      -0.194618
Omer  -0.104642       NaN      -1.162470

In [41]:
df1["Yas"] > 0

Ayse      True
Osman    False
Arzu     False
Omer      True
Name: Yas, dtype: bool

In [43]:
df1[df1["Yas"] > 0]

          Maas       Yas  Calisma Saati
Ayse  0.678673  0.029058       0.174665
Omer -0.104642  0.085332      -1.162470

In [44]:
df1[df1["Calisma Saati"] > 0]

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087

In [45]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [46]:
df1.reset_index()

   index      Maas       Yas  Calisma Saati
0   Ayse  0.678673  0.029058       0.174665
1  Osman  0.230443 -0.784472       0.084087
2   Arzu  0.910762 -0.294128      -0.194618
3   Omer -0.104642  0.085332      -1.162470

In [47]:
df1

           Maas       Yas  Calisma Saati
Ayse   0.678673  0.029058       0.174665
Osman  0.230443 -0.784472       0.084087
Arzu   0.910762 -0.294128      -0.194618
Omer  -0.104642  0.085332      -1.162470

In [48]:
indexList = ["Ay","Os","Ar","Om"]

In [49]:
df1["Yeni index"] = indexList

In [50]:
df1

           Maas       Yas  Calisma Saati Yeni index
Ayse   0.678673  0.029058       0.174665         Ay
Osman  0.230443 -0.784472       0.084087         Os
Arzu   0.910762 -0.294128      -0.194618         Ar
Omer  -0.104642  0.085332      -1.162470         Om

In [52]:
df1.set_index("Yeni index")

                Maas       Yas  Calisma Saati
Yeni index
Ay          0.678673  0.029058       0.174665
Os          0.230443 -0.784472       0.084087
Ar          0.910762 -0.294128      -0.194618
Om         -0.104642  0.085332      -1.162470

In [53]:
df1

           Maas       Yas  Calisma Saati Yeni index
Ayse   0.678673  0.029058       0.174665         Ay
Osman  0.230443 -0.784472       0.084087         Os
Arzu   0.910762 -0.294128      -0.194618         Ar
Omer  -0.104642  0.085332      -1.162470         Om

In [54]:
df1.set_index("Yeni index", inplace = True)

In [55]:
df1

                Maas       Yas  Calisma Saati
Yeni index
Ay          0.678673  0.029058       0.174665
Os          0.230443 -0.784472       0.084087
Ar          0.910762 -0.294128      -0.194618
Om         -0.104642  0.085332      -1.162470

In [58]:
df1.loc["Ay"]

Maas             0.678673
Yas              0.029058
Calisma Saati    0.174665
Name: Ay, dtype: float64

In [64]:
first_index = ["Tom_Jerry", "Tom_Jerry","Candy_Heidi","Candy_Heidi"]

In [66]:
inner_index = ["Tom" ,"Jerry" , "Candy","Heidi"]

In [68]:
zip_index = list(zip(first_index,inner_index))

In [69]:
zip_index

[('Tom_Jerry', 'Tom'),
 ('Tom_Jerry', 'Jerry'),
 ('Candy_Heidi', 'Candy'),
 ('Candy_Heidi', 'Heidi')]

In [70]:
zip_index = pd.MultiIndex.from_tuples(zip_index)

In [71]:
zip_index

MultiIndex([(  'Tom_Jerry',   'Tom'),
            (  'Tom_Jerry', 'Jerry'),
            ('Candy_Heidi', 'Candy'),
            ('Candy_Heidi', 'Heidi')],
           )

In [72]:
type(zip_index)

pandas.core.indexes.multi.MultiIndex

In [74]:
myCartoonList = [[40,"A"],[50,"B"],[60,"C"],[70,"D"]]

In [75]:
npCartoon = np.array(myCartoonList)

In [77]:
dfCartton = pd.DataFrame(npCartoon, index = zip_index , columns =["Yas" ,"Meslek"])

In [80]:
dfCartton

                  Yas Meslek
Tom_Jerry   Tom    40      A
            Jerry  50      B
Candy_Heidi Candy  60      C
            Heidi  70      D

In [81]:
dfCartton.loc["Tom_Jerry"]

      Yas Meslek
Tom    40      A
Jerry  50      B

In [82]:
dfCartton.loc["Candy_Heidi"]

      Yas Meslek
Candy  60      C
Heidi  70      D

In [83]:
dfCartton.loc["Candy_Heidi"].loc["Candy"]

Yas       60
Meslek     C
Name: Candy, dtype: object

In [84]:
dfCartton.index.names = ["Cizgi Film" , "Karakter"]

In [85]:
dfCartton

                     Yas Meslek
Cizgi Film  Karakter
Tom_Jerry   Tom       40      A
            Jerry     50      B
Candy_Heidi Candy     60      C
            Heidi     70      D